app/views/ideas/index.html.erb

  <p>"<%= idea.content %>"</p>
  <a href="/ideas/<%= idea.id %>"><%= idea.likes.count %> people</a> like this</p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."idea_id" = ?  [["idea_id", 1]]


  <% if idea.users_liked.include?(current_user) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."idea_id" = ? AND "likes"."user_id" = 1 LIMIT 1  [["idea_id", 2]]
SELECT  1 AS one FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = ? AND "users"."id" = ? LIMIT 1  [["idea_id", 2], ["id", 1]]