app/views/ideas/show.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."idea_id" = ?  [["idea_id", 5]]
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = ?  [["idea_id", 5]]
---
  </tr>
  <% @idea.users_liked.each do |like| %>