app/views/users/show.html.erb

SELECT COUNT(*) FROM "ideas" INNER JOIN "likes" ON "ideas"."id" = "likes"."idea_id" WHERE "likes"."user_id" = ?  [["user_id", 1]]
---
<hr>
<p>Total Number of Posts: <%=@user.ideas.count %></p>