app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"
---
  def index
    @user = current_user
    @ideas = Idea.all

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 1]]
---
  def destroy
    idea = Idea.find(params[:id])
    idea.destroy if idea.user == current_user