app/controllers/likes_controller.rb

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "likes" ("user_id", "idea_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["idea_id", 2], ["created_at", "2016-10-21 19:40:41.689445"], ["updated_at", "2016-10-21 19:40:41.689445"]]
---
  def create
    idea = Idea.find(params['idea_id'])
    like = Like.create(user: current_user, idea: idea)

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    like = Like.find(params[:id]).destroy